# Напиши функцію sum_of_two_lowest, яка приймає список цілих чисел та повертає суму двох найменших значень.
# Мінімальна довжина списку – 4 цілих числа.
# Примітка: елементами списку є тільки цілі числа.
# Приклади:
# sum_of_two_lowest([19, 5, 42, 2, 77]) == 7
# sum_of_two_lowest([10, 343445353, 3453445, 3453545353453]) == 3453455


def sum_of_two_lowest(num_list: list) -> int:
    # Сортуємо список за зростанням
    sorted_list = sorted(num_list)

    # Знаходимо суму двох найменших значень
    sum_of_lowest = sorted_list[0] + sorted_list[1]

    # Повертаємо суму
    return sum_of_lowest
