# Міжнародна азбука Морзе є стандартним кодуванням, в якому кожна літера зіставляється з рядом точок і тире в такому вигляді:
# 
# "a": ".-",
# "b": "-...",
# "c": "-.-.",
# "d": "-..",
# "e": ".",
# "f": "..-.",
# "g": "--.",
# "h": "....",
# "i": "..",
# "j": ".---",
# "k": "-.-",
# "l": ".-..",
# "m": "--",
# "n": "-.",
# "o": "---",
# "p": ".--.",
# "q": "--.-",
# "r": ".-.",
# "s": "...",
# "t": "-",
# "u": "..-",
# "v": "...-",
# "w": ".--",
# "x": "-..-",
# "y": "-.--",
# "z": "--.."
# 
# Маючи список з рядками words, напиши функцію unique_code, яка перетворює слова у списку на азбуку Морзе і повертає кількість різних фінальних символьних варіацій.
# 
# Приклади:
# 
# unique_code(["abc", "efg", "zxc"]) == 3
# "abc" = ".-" + "-..." + "-.-." = ".--...-.-."
# "efg" = "." + "..-." + "--." = "...-.--."
# "xyz" = "-..-" + "-.--" + "--.." = "-..--.----.."
# 3 різних комбінації Морзе

# unique_code(["gin", "zen"]) == 1
# "gin" = "--." + ".." + "-." = "--...-."
# "zen" = "--.." + "." + "-." = "--...-."
# 1 комбінація Морзе, тому що обидва набори символів є однаковими

MORSE_CODE = {
    "a": ".-",
    "b": "-...",
    "c": "-.-.",
    "d": "-..",
    "e": ".",
    "f": "..-.",
    "g": "--.",
    "h": "....",
    "i": "..",
    "j": ".---",
    "k": "-.-",
    "l": ".-..",
    "m": "--",
    "n": "-.",
    "o": "---",
    "p": ".--.",
    "q": "--.-",
    "r": ".-.",
    "s": "...",
    "t": "-",
    "u": "..-",
    "v": "...-",
    "w": ".--",
    "x": "-..-",
    "y": "-.--",
    "z": "--.."
}


def unique_code(words: list) -> int:
    codes = set()
    for word in words:
        code = ""
        for char in word:
            code += MORSE_CODE[char]
        codes.add(code)
    return len(codes)
