# Напиши функцію coin_combination, яка приймає значення cents і повертає список у наступному форматі:
# [0, 0, 0, 0]
# # індекс [0] відображає пенні (1 цент)
# # індекс [1] відображає п'ятаки (5 центів)
# # індекс [2] відображає дайми (10 центів)
# # індекс [3] відображає четвертаки (25 центів)
# Приклади:
# coin_combination(6) == [1, 1, 0, 0]
# coin_combination(42) == [2, 1, 1, 1]
# coin_combination(100) == [0, 0, 0, 4]

def coin_combination(cents: int) -> list:
    coins = [1, 5, 10, 25]  # значення монет
    counts = [0, 0, 0, 0]  # початкові значення лічильників

    for i in range(len(coins) - 1, -1, -1):  # проходимо по монетам в зворотньому порядку
        while cents >= coins[i]:  # додаємо монету до тих пір, поки можна
            cents -= coins[i]
            counts[i] += 1

    return counts
