# Послідовність count_and_say — це послідовність рядків цифр, що визначається рекурсивною формулою:
# countAndSay(1) = "1"
# countAndSay(number) - це те, як ты "вимовляєш" рядок цифр з countAndSay(number - 1), який потім перетворюється на інший рядок цифр.
# Щоб визначити, як ти "вимовляєш" числовий рядок, розбий її на мінімальну кількість підрядків, щоб кожен підрядок містив рівно одну унікальну цифру. Потім для кожного підрядку промов кількість цифр, потім промовте цифру. Нарешті, з'єднайте кожну цифру.
# Наприклад, висловлювання та перетворення для рядка цифр ``3322251'`
# Тобі дано позитивне ціле число number, поверни n=number-й член послідовності count_and_say.
# Примітки:
# 1 <= number <= 30
# Приклади:
# count_and_say(1)  # повертає "1"
# count_and_say(4)  # повертає "1211" - Пояснення:
# # countAndSay(1) = "1"
# # countAndSay(2) = каже "1" = одна 1 = "11"
# # countAndSay(3) = каже "11" = дві 1 = "21"
# # countAndSay(4) = каже "21" = одна 2 + одна 1 = "12" + "11" = "1211"

import itertools


def count_and_say(number: int) -> str:
    say = "1"
    for _ in range(number - 1):
        say = "".join(
            str(len(list(group))) + digit
            for digit, group in itertools.groupby(say)
        )
    return say
