# Run-length encoding (RLE) - це дуже проста форма стиснення даних без втрат,
# коли серії даних зберігаються як одне значення-представник групи і число значень конкретної групи.
# Проста форма RLE кодує рядок AAABBBCCCD як 3A3B3C1D, що означає, що спочатку йде 3 A, потім 3 B, 3 C і 1 D.
# Твоє завдання – написати функцію data_compression, яка використовуватиме техніку RLE.
# Тексти для кодування завжди будуть містити лише символи верхнього регістру, без цифр.

def data_compression(data: str) -> str:
    compressed_data = ""
    count = 1

    for i in range(len(data)):
        # Перевіряємо, чи наступний символ є такий же, як поточний
        if i + 1 < len(data) and data[i] == data[i + 1]:
            count += 1
        else:
            # Якщо наступний символ відрізняється, то додаємо інформацію про повторення до стисненого рядка
            compressed_data += str(count) + data[i]
            count = 1

    return compressed_data
