# Напиши функцію find_number, яка приймає аргументи start, stop та string який містить числа від start до stop,
# одне з цих чисел буде відсутнє і рядок буде перемішано,
# функція має повернути список можливих відсутніх чисел, якщо таких немає, повернути порожній список.
# Приклади:
# find_number(1, 21, "2198765123416171890101112131415")  # повертає [12, 21] - ти не зможеш сказати, 21 це або 12,
# # тому краще повертати всі можливі значення в списку.
# find_number(5, 10, "578910")  # повертає [6]

def find_number(start: int, stop: int, string: str) -> list:
    # write your code here
    pass
