# У далекій країні АлгоЛандії є N островів, пронумерованих від 1 до N. Кожен острів позначається islands[i].
# Король АлгоЛандії Алголас, побудував N - 1 мостів в країні. Міст будується між islands[i] та islands[i+1].
# Мости двосторонні та дорогі у будівництві.
# Проблема в тому, що є банди, які бажають зруйнувати мости. Щоб захистити мости, король хоче приставити до мостів елітну варту.
# Міст між islands[i] та islands[i+1] є безпечним, якщо на islands[i] або islands[i+1] є елітна варта. На деяких островах вже є елітні охоронці.
# Напиши функцію find_needed_guards яка приймає список islands та повертає мінімальну кількість додаткових елітних охоронців, яких необхідно найняти для охорони всіх мостів.
# Примітка:
# Тобі дана послідовність островів завдовжки N
# islands[i] is True означає, що на цьому острові є елітна варта
# islands[i] is False означає відсутність елітної охорони
# Гарантується, що в islands є як мінімум 2 острови
# Приклади:

find_needed_guards([True, True, False, True, False])  # повертає 0
find_needed_guards([False, False, True, False, False])  # повертає 2

def find_needed_guards(islands: list) -> int:
    # write your code here
    pass
