# Напиши функцію get_reversed_color, яка приймає шістнадцятковий рядок кольору і повертає рядок, що являє собою додатковий колір.
#
# Що таке шістнадцятковий колір? Ви можете знайти відповідь на w3schools і Википедії
#
# get_reversed_color приймає тільки один аргумент - рядок з шістнадцятковим значенням (без врахування реєстру з символами 0..9 або A..F) і без хэш-символа "#". Аргумент hex_color не обов'язково має бути 6 символів в довжину - інші символи заповнюються нулями:
#
# "а23" <=> "000а23"
# "" <=> "0" <=> "000000"
#
# Вивід являє собою рядок в верхньому реєстрі, що містить символ решітки (#) і додатковий колір. Додатковий колір – це колір, що дає в сумі повністю білий колір разом з аргументом hex_color: #000A23 + #FFF5DC = #FFFFFF
#
# Помилки: Якщо введений рядок невірний: довжина 7+, символи не шістнадцяткові або не строковий тип, то повинна повернутися помилка
#
# get_reversed_color("00fffff")  # піднімає ValueError
# get_reversed_color("00ffZZ")  # піднімає ValueError
# get_reversed_color(112233)  # піднімає ValueError
#
# Приклади:
#
# get_reversed_color("01fD08") # повертає "#FE02F7"
# get_reversed_color("") # повертає "FFFFFF"
# get_reversed_color("a23") # повертає "#FFF5DC"

def get_reversed_color(hex_color: str) -> str:
    # write your code here
    pass
