# Напиши функцію max_sub_list, яка приймає список чисел nums, знаходить безперервний підсписок (що містить хоча б одне число)
# який має найбільшу суму та повертає цю суму.
# Примітка:
# Підсписок є безперервною частиною списку
# 1 <= len(nums)
# -10000 <= nums[i] <= 10000
# Приклади:
# max_sub_list([-2, 1, -3, 4, -1, 2, 1, -5, 4])  # повертає 6 - [4, -1, 2, 1] має найбільшу суму = 6.
# max_sub_list([1])  # повертає 1
# max_sub_list([[5, 4, -1, 7, 8]])  # повертає 23
# Наступні дії: якщо ти знайшов рішення O(n), спробуй написати інше рішення, використовуючи більш тонкий підхід розділяй і володарюй.

def max_sub_list(nums: list[int]) -> int:
    max_sum = float("-inf")
    current_sum = 0

    for num in nums:
        current_sum = max(num, current_sum + num)
        max_sum = max(max_sum, current_sum)

    return max_sum
