# Напиши функцію pendulum яка приймає список lst що складається з n цілих чисел, і впорядковує їх так само як і рух маятника – туди-сюди.
# Найменший елемент списку повинен знаходитися в центральній позиції. Елемент більший, ніж найменший, йде праворуч.
# Наступний великий елемент йде вліво від мінімального числа і так далі, туди-сюди, як у маятника. Функція має повертати список упорядкованих чисел.
# Примітки:
# розмір lst не менше 3 елементів
# в Парному розмірі списку мінімальний елемент повинен бути переміщений в індекс (n-1)/2 (з огляду на те, що індекси починаються з 0)
# Номери у списку можуть повторюватись, тобто. (Дублювання враховуються при розстановці).
# Приклад:
# pendulum([6, 6, 8, 5, 10])  # повертає [10, 6, 5, 6, 8]
# # Оскільки 5 є найменшим елементом списку,
# # він потрапляє у центральну позицію списку.
# # Більший, ніж найменший елемент дорівнює 6 і йде праворуч від 5.
# # Наступний більший елемент йде ліворуч від мінімального числа тощо.
# # Пам'ятай, дублікати враховуються при розміщенні, не видаляй їх.
# pendulum([-9, -2, -10, -6])  # повертає [-6, -10, -9, -2]

def pendulum(lst: list) -> list:
    # write your code here
    pass
