# Тобі дано велике ціле число, подане у вигляді списку цілих чисел digits, де кожен digits[i] - це i-я цифра цілого числа. Велике ціле число не починається з нуля.
# Напиши функцію plus_one, яка приймає список digits, збільшує число на одиницю та повертає результуючий список цифр.
# Примітки:
# 1 <= len(digits) <= 100
# 0 <= digits[i] <= 9
# digits не починається з 0
# Приклади:
# plus_one([1, 2, 3])  # повертає [1, 2, 4] — список представляє ціле число 123
# # Збільшення на одиницю дає 123 + 1 = 124
# plus_one([4, 3, 2, 1])  # повертає [4, 3, 2, 2] — список представляє ціле число 4321
# # Збільшення на одиницю дає 4321 + 1 = 4322
# plus_one([9])  # повертає [1, 0] - список представляє ціле число 9
# # Збільшення на одиницю дає 9+1=10


def plus_one(digits: list[int]) -> list[int]:
    # ітеруємо цифри з кінця списку та збільшуємо їх на одиницю
    for i in range(len(digits) - 1, -1, -1):
        if digits[i] < 9:
            digits[i] += 1
            break
        else:
            digits[i] = 0
            if i == 0:
                digits.insert(0, 1)
    return digits
