# Напиши функцію remove_element яка приймає список цілих чисел nums та число val, потрібно видалити всі входження val у nums на місці.
# Більш формально, якщо після видалення дублікатів залишилося k елементів, тоді перші k елементів nums повинні містити остаточний результат.
# Поверни k після приміщення остаточного результату в перші k слоти nums.
# Не виділяйте додаткове місце для іншого списку. Ви повинні зробити це, змінивши список введення на місці з константним обсягом пам'ятіO(1).
# Приклади:
# remove_elements([3, 2, 2, 3], 3)  # повертає 2 - твоя функція повинна повертати k = 2,
# # c двома елементами nums рівними 2.
# remove_elements([0, 1, 2, 2, 3, 0, 4, 2], 2)  # повертає 5 - твоя функція повинна повертати k = 5,
# з п'ятьма елементами nums, що містять 0, 1, 3, 0 та 4.

def remove_element(nums: list, target: int) -> int:
    new_nums = [num for num in nums if num != target]
    nums.clear()
    nums.extend(new_nums)
    return len(nums)
