# Напиши функцію rgb_to_hex, яка приймає три аргументи r, g, b які є десятковими значеннями,
# перетвори їх на шістнадцятковий формат та поверни результат у вигляді рядка.
# Допустимі десяткові значення для RGB: 0–255. Будь-які значення, що випадають із цього діапазону,
# повинні бути округлені до найближчого допустимого значення. Твоя відповідь завжди повинна складатися із 6 символів.
# Приклад:
# rgb_to_hex(255, 255, 255) # повертає "FFFFFF"
# rgb_to_hex(255, 255, 300) # повертає "FFFFFF"
# rgb_to_hex(0,0,0) # повертає "000000"
# rgb_to_hex(-20, 275, 125) # повертає "00FF7D"

def rgb_to_hex(r: int, g: int, b: int) -> str:
    r = max(0, min(r, 255))
    g = max(0, min(g, 255))
    b = max(0, min(b, 255))
    return f"{r:02X}{g:02X}{b:02X}".upper()
