# Розглянемо послідовність U(n, x) = x + 2**2 + 3x**3 +.. + nx**n, де x
# дійсне число, а n - додатне ціле число.
# Коли n прагне нескінченності, а x має правильне значення (тобто x знаходиться у своїй області збіжності D), U(n, x)
# досягає кінцевої межі m залежно від x.
# Зазвичай по заданому x ми намагаємось знайти m. Тут ми спробуємо знайти x (x дійсне число, 0 < x < 1),
# коли m задано (m дійсне число, m > 0).
# Напиши функцію solve(m) яка повертає x, як, наприклад U(n, x) переходить у m, коли n прагне до нескінченності.
# Примітка: Тести пройдуть, якщо abs(фактичне - очікуване) <= 1e-12
# Приклади:
# solve(2.0)  # повертає 0,5, оскільки U(n, 0,5) стає рівним 2, коли n прагне нескінченності
# solve(8.0)  # повертає 0,7034648345913732, так як U(n, 0,7034648345913732) стає рівним 8, коли n прагне до нескінченності

def solve(m: float) -> float:
    return (2 * m + 1 - (4 * m + 1) ** 0.5) / (2 * m)
