# Напиши функцію sum_of_pairs, яка приймає список чисел nums та число sum_value.
# Функція повертає список із першими двома значеннями (проходьте список зліва направо), що складаються у sum_of_pairs.
# Якщо немає значень, які утворюють суму, поверніть None. В nums можуть з'являтися негативні числа і числа, що повторюються, .
# Приклад:
# sum_of_pairs([11, 3, 7, 5], 10) # повертає [3, 7] тому, що 3 + 7 = 10
# sum_of_pairs([4, 3, 2, 3, 4], 6) # повертає [4, 2] тому що, 4 + 2 - перша пара, що утворює 6
# sum_of_pairs([0, 0, -2, 3], 2) # повертає None
# sum_of_pairs([10, 5, 2, 3, 7, 5], 10) # повертає [5, 5]


def sum_of_pairs(nums: list, sum_value: int) -> list:
    # write your code here
    pass
