# Sum of digits - це рекурсивна сума усіх цифр у числі.
# Напиши функцію sum_of_digits, яка приймає number та повертає суму цифр number. Якщо це значення має більше однієї цифри,
# продовжуй зменшувати його таким чином, доки не буде отримано однозначне число.
# Функція приймає додатне ціле число.
# Приклади:
#     16  -->  1 + 6 = 7
#    942  -->  9 + 4 + 2 = 15  -->  1 + 5 = 6
# 132189  -->  1 + 3 + 2 + 1 + 8 + 9 = 24  -->  2 + 4 = 6
# 493193  -->  4 + 9 + 3 + 1 + 9 + 3 = 29  -->  2 + 9 = 11  -->  1 + 1 = 2

def sum_of_digits(number: int) -> int:
    while number > 9:
        number = sum(map(int, str(number)))
    return number
